app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("completed", "created_at", "priority", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["completed", "t"], ["created_at", "2014-10-14 21:08:09.338990"], ["priority", 5], ["title", "Crack the eggs"], ["updated_at", "2014-10-14 21:08:09.338990"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save